INSERT INTO genres (name)
VALUES 
	('Рок'),
	('Попса'),
	('Шансон'),
	('Рэп'),
	('Детские песни')
	
INSERT INTO artists (name)
VALUES 
	('Сплин'),
	('Руки Вверх'),
	('Ария'),
	('Михаил Круг'),
	('Кино'),
	('Noize MC'),
	('Детский хор'),
	('Порнофильмы')
	
INSERT INTO albums (name, release)
VALUES 
	('Вира и майна' , '11.12.2020'),
	('Без тормозов', '01.05.1999'),
	('Проклятье морей', '13.11.2018'),
	('Мышка', '01.05.2000'),
	('Группа крови', '05.01.1988'),
	('No comments','07.11.2018'),
	('Великан','17.12.2021'),
	('Это пройдет','29.01.2020')

INSERT INTO artistsalbums 
VALUES 
	(1,1),
	(2,2),
	(3,3),
	(4,4),
	(5,5),
	(6,6),
	(7,7),
	(8,8)

INSERT INTO artistsgenres  
VALUES 
	(1,1),
	(1,2),
	(2,2),
	(3,1),
	(4,3),
	(5,1),
	(6,1),
	(6,4),
	(7,5),
	(8,1)

	
INSERT INTO tracks (album_id, name, time)
VALUES 
	( 1, 'Беги, моя жизнь' , 270),
	( 1, 'Кошмары' , 244),
	( 2, 'Атаман' , 304),
	( 2, 'Дома не сиди' , 235),
	( 3, 'Варяг' , 399),
	( 3, 'Дым без огня' , 452),
	( 4, 'Рубикон' , 164),
	( 4, 'Браво' , 169),
	( 5, 'Война' , 244),
	( 5, 'Лененда' , 250),
	( 6, 'В темноте' , 207),
	( 6, 'Зубы мудрости' , 183),
	( 7, 'Моя мечта' , 195),
	( 8, 'Дядя Володя' , 186),
	( 8, 'Чужое горе' , 205)
	( 6, 'Все как у людей', 300)

INSERT INTO collections  (name, release)
VALUES 
	('Рок волна' , '11.12.2021'),
	('Рэп волна', '01.05.2019'),
	('Хиты 2000', '13.11.2018'),
	('Сборник детских песен', '01.05.2021'),
	('Рок и реп', '05.01.2022'),
	('Спец. альбом','07.11.2021'),
	('Мы все...','17.10.2021'),
	('Новое покололение','24.12.2020')
	
INSERT INTO collectionstracks   
VALUES 
	(1,1),
	(1,2),
	(1,9),
	(2,12),
	(2,13),
	(3,14),
	(3,15),
	(4,11),
	(5,3),
	(5,4),
	(5,6),
	(6,5),
	(6,8),
	(7,7),
	(7,10),
	(8,9),
	(8,5)
